<a href="https://colab.research.google.com/github/ipeirotis/introduction-to-databases/blob/master/session5/practice_queries_aggregation_solution.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Session 5: Practice Aggregate Queries: Solutions


In this segment we will connect to the *Restaurants* database.

## Setup

In [0]:
!apt-get install python3-mysqldb
!pip install sqlalchemy sql_magic

In [0]:
# This code creates a connection to the database
from sqlalchemy import create_engine

conn_string = 'mysql://{user}:{password}@{host}/{db}?charset={encoding}'.format(
    host = 'db.ipeirotis.org', 
    user = 'student',
    db = 'restaurants',
    password = 'dwdstudent2015',
    encoding = 'utf8mb4')

engine = create_engine(conn_string)
con = engine.connect()

In [0]:
%reload_ext sql_magic

In [0]:
%config SQL.conn_name = 'engine'

## Question 1: How many Manhattan restaurants are listed in your database

In [5]:
%%read_sql
SELECT borough, COUNT(*) AS num_restaurants
FROM Restaurant
WHERE borough = 'Manhattan'
GROUP BY borough

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

     borough  num_restaurants
0  Manhattan                5

## Question 2: Output the affiliation (or '-' for freelancers) and how many critics are associated with this affiliation;

In [6]:
%%read_sql
SELECT affiliation, COUNT(*) AS num_critics
FROM Critic
GROUP BY affiliation

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

  affiliation  num_critics
0        None            2
1   Chronicle            1
2         NYP            2
3         NYT            3
4       Vogue            1
5          WP            1

If we want to replace the NULL value in affiliation with `-`,  we use the `COALESCE` command, that replaces NULL with the value that we pass as parameter.

In [7]:
%%read_sql
SELECT COALESCE(affiliation, '-') AS affiliation, COUNT(*) AS num_critics
FROM Critic
GROUP BY affiliation

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

  affiliation  num_critics
0           -            2
1   Chronicle            1
2         NYP            2
3         NYT            3
4       Vogue            1
5          WP            1

## Question 3: Output the critic id together with the maximal star rating ever issued by this critic;

In [8]:
%%read_sql
SELECT cID, MAX(starRating) AS maxRating
FROM Rating
GROUP BY cID

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

     cID  maxRating
0  201.0        4.0
1  202.0        4.0
2  203.0        4.0
3  204.0        3.0
4  205.0        5.0
5  206.0        5.0
6  208.0        3.0
7  209.0        3.0

## Question 4: Output the critic id and the restaurant code together with the maximal star rating ever issued by this critic for this restaurant;

In [9]:
%%read_sql
SELECT cID, restCode, MAX(starRating) AS maxRating
FROM Rating
GROUP BY cID, restCode

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

      cID  restCode  maxRating
0   201.0     101.0        4.0
1   202.0     106.0        4.0
2   203.0     103.0        2.0
3   203.0     108.0        4.0
4   204.0     101.0        3.0
5   205.0     103.0        3.0
6   205.0     104.0        2.0
7   205.0     108.0        5.0
8   206.0     106.0        5.0
9   206.0     107.0        3.0
10  208.0     104.0        3.0
11  209.0     104.0        3.0

## Question 5: For every borough, cuisine pair output the minimal price and order the output by borough in the ascending order (consider only the restaurants outside of Manhattan);

In [10]:
%%read_sql
SELECT borough, cuisine, MIN(avgPrice) AS minPrice
FROM Restaurant
WHERE borough != 'Manhattan'
GROUP BY borough, cuisine

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

    borough  cuisine  minPrice
0     Bronx  Italian      75.0
1  Brooklyn  Chinese      75.0
2  Brooklyn    Greek     150.0
3  Brooklyn     Thai     100.0
4    Queens    Greek     130.0
5    Queens  Italian      75.0

## Question 6: For every borough, cuisine pair output the minimal price where the minimal price is greater than $100;

In [11]:
%%read_sql
SELECT borough, cuisine, MIN(avgPrice) AS minPrice
FROM Restaurant
GROUP BY borough, cuisine
HAVING minPrice>100

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

     borough  cuisine  minPrice
0   Brooklyn    Greek     150.0
1  Manhattan  Chinese     125.0
2  Manhattan  Italian     150.0
3     Queens    Greek     130.0

## Question 7: For every borough, cuisine pair output the minimal price where the minimal price is greater than $100 and order the output by the price value in the descending order.

In [12]:
%%read_sql
SELECT borough, cuisine, MIN(avgPrice) AS minPrice
FROM Restaurant
GROUP BY borough, cuisine
HAVING minPrice>100
ORDER BY minPrice DESC

Query started at 03:57:26 PM UTC; Query executed in 0.00 m

     borough  cuisine  minPrice
0   Brooklyn    Greek     150.0
1  Manhattan  Italian     150.0
2     Queens    Greek     130.0
3  Manhattan  Chinese     125.0